---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomBelowCompHeight
source: html/c255ac0d-0096-e7ec-3e8e-179e310bc219.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomBelowCompHeight Property

[Room] Volume is being calculated above the Upper Limit of this [Room]. Change the Upper Limit and Offset or change the height of volume calculations.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomBelowCompHeight { get; }
```